{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Desktop\GitHub\agrogan1.github.io\myposts\why-Excel-is-a-bad-format-for-storing-data.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}20 Jul 2022, 09:05:37
{txt}
{com}. //_1
. display c(current_date)
{res}20 Jul 2022
{txt}
{com}. //_2
. display c(current_time)
{res}09:05:37
{txt}
{com}. //_3
. clear all
{res}{txt}
{com}. //_4
. set obs 100 // 100 observations
{txt}{p}
Number of observations ({bf:_N}) was 0,
now 100.
{p_end}

{com}. //_5
. generate id = _n // id variable
{txt}
{com}. //_6
. label variable id "id"
{txt}
{com}. //_7
. generate Q1 = runiformint(1,4) // randomly simulated Question 1
{txt}
{com}. //_8
. label variable Q1 "How often do you feel happy?" // add variable label
{txt}
{com}. //_9
. label define Likert1 1 "Never" 2 "Rarely" 3 "Sometimes" 4 "Often" // define value label
{txt}
{com}. //_10
. label values Q1 Likert1 // add value label to Q1
{txt}
{com}. //_11
. describe

{txt}Contains data
 Observations:{res}           100                  
{txt}    Variables:{res}             2                  
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}id{p_end}
{p 0 48}{bind:Q1             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:Likert1  }{bind:  }{res}{res}How often do you feel happy?{p_end}
{txt}{hline}
Sorted by: 
{res}     Note: Dataset has changed since last saved.
{txt}
{com}. //_12
. list in 1/10
{txt}
     {c TLC}{hline 4}{c -}{hline 11}{c TRC}
     {c |} {res}id          Q1 {txt}{c |}
     {c LT}{hline 4}{c -}{hline 11}{c RT}
  1. {c |} {res} 1      Rarely {txt}{c |}
  2. {c |} {res} 2   Sometimes {txt}{c |}
  3. {c |} {res} 3       Often {txt}{c |}
  4. {c |} {res} 4       Often {txt}{c |}
  5. {c |} {res} 5   Sometimes {txt}{c |}
     {c LT}{hline 4}{c -}{hline 11}{c RT}
  6. {c |} {res} 6      Rarely {txt}{c |}
  7. {c |} {res} 7       Often {txt}{c |}
  8. {c |} {res} 8   Sometimes {txt}{c |}
  9. {c |} {res} 9       Often {txt}{c |}
 10. {c |} {res}10      Rarely {txt}{c |}
     {c BLC}{hline 4}{c -}{hline 11}{c BRC}

{com}. //_13
. tabulate Q1

  {txt}How often {c |}
do you feel {c |}
     happy? {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      Never {c |}{res}         20       20.00       20.00
{txt}     Rarely {c |}{res}         24       24.00       44.00
{txt}  Sometimes {c |}{res}         23       23.00       67.00
{txt}      Often {c |}{res}         33       33.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        100      100.00
{txt}
{com}. //_14
. graph bar, over(Q1) scheme(michigan)
{res}{txt}
{com}. //_15
. graph export mybar1.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
mybar1.png{rm}
saved as
PNG
format
{p_end}

{com}. //_16
. label variable Q1 // drop variable label
{txt}
{com}. //_17
. label values Q1 // drop value label 
{txt}
{com}. //_18
. tabulate Q1

         {txt}Q1 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         20       20.00       20.00
{txt}          2 {c |}{res}         24       24.00       44.00
{txt}          3 {c |}{res}         23       23.00       67.00
{txt}          4 {c |}{res}         33       33.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        100      100.00
{txt}
{com}. //_19
. graph bar, over(Q1) scheme(michigan)
{res}{txt}
{com}. //_20
. graph export mybar2.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
mybar2.png{rm}
saved as
PNG
format
{p_end}

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Desktop\GitHub\agrogan1.github.io\myposts\why-Excel-is-a-bad-format-for-storing-data.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}20 Jul 2022, 09:05:40
{txt}{.-}
{smcl}
{txt}{sf}{ul off}