{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Desktop\GitHub\agrogan1.github.io\myposts\why-Excel-is-a-bad-format-for-storing-data.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}26 Jul 2022, 12:40:33
{txt}
{com}. //_1
. display c(current_date)
{res}26 Jul 2022
{txt}
{com}. //_2
. display c(current_time)
{res}12:40:33
{txt}
{com}. //_3q
. * setup
. 
. clear all
{res}{txt}
{com}.     
. set seed 3846 // random seed for data
{txt}
{com}. 
. * simulate data so that we have some data to work with
. 
. quietly set obs 100 // 100 observations
{txt}
{com}.     
. generate id = _n // id variable
{txt}
{com}.     
. label variable id "id"
{txt}
{com}. 
. generate Q1 = runiformint(1,4) // randomly simulated Question 1
{txt}
{com}. 
. label variable Q1 "How often do you feel happy?" // add variable label
{txt}
{com}. 
. label define Likert1 1 "Never" 2 "Rarely" 3 "Sometimes" 4 "Often" // define value label
{txt}
{com}.     
. label values Q1 Likert1 // add value label to Q1
{txt}
{com}.     
. quietly save "simulated-happiness-data.dta", replace
{txt}
{com}. //_4
. use "simulated-happiness-data.dta", clear
{txt}
{com}. //_5
. describe

{txt}Contains data from {res}simulated-happiness-data.dta
{txt} Observations:{res}           100                  
{txt}    Variables:{res}             2                  26 Jul 2022 12:40
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}id{p_end}
{p 0 48}{bind:Q1             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:Likert1  }{bind:  }{res}{res}How often do you feel happy?{p_end}
{txt}{hline}
Sorted by: 

{com}. //_6
. tabulate Q1

  {txt}How often {c |}
do you feel {c |}
     happy? {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      Never {c |}{res}         21       21.00       21.00
{txt}     Rarely {c |}{res}         29       29.00       50.00
{txt}  Sometimes {c |}{res}         28       28.00       78.00
{txt}      Often {c |}{res}         22       22.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        100      100.00
{txt}
{com}. //_7
. graph bar, over(Q1) scheme(michigan2) asyvars
{res}{txt}
{com}.     
. graph export mybar1.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
mybar1.png{rm}
saved as
PNG
format
{p_end}

{com}. //_8
. list in 1/10
{txt}
     {c TLC}{hline 4}{c -}{hline 11}{c TRC}
     {c |} {res}id          Q1 {txt}{c |}
     {c LT}{hline 4}{c -}{hline 11}{c RT}
  1. {c |} {res} 1       Never {txt}{c |}
  2. {c |} {res} 2   Sometimes {txt}{c |}
  3. {c |} {res} 3       Never {txt}{c |}
  4. {c |} {res} 4   Sometimes {txt}{c |}
  5. {c |} {res} 5   Sometimes {txt}{c |}
     {c LT}{hline 4}{c -}{hline 11}{c RT}
  6. {c |} {res} 6       Often {txt}{c |}
  7. {c |} {res} 7      Rarely {txt}{c |}
  8. {c |} {res} 8   Sometimes {txt}{c |}
  9. {c |} {res} 9       Never {txt}{c |}
 10. {c |} {res}10      Rarely {txt}{c |}
     {c BLC}{hline 4}{c -}{hline 11}{c BRC}

{com}. //_9q
. quietly export excel using "simulated-happiness-data.xls", ///
> firstrow(variables) nolabel replace
{txt}
{com}. //_10
. import excel "simulated-happiness-data.xls", sheet("Sheet1") firstrow clear
{res}{text}(2 vars, 100 obs)

{com}. //_11
. list in 1/10
{txt}
     {c TLC}{hline 4}{c -}{hline 4}{c TRC}
     {c |} {res}id   Q1 {txt}{c |}
     {c LT}{hline 4}{c -}{hline 4}{c RT}
  1. {c |} {res} 1    1 {txt}{c |}
  2. {c |} {res} 2    3 {txt}{c |}
  3. {c |} {res} 3    1 {txt}{c |}
  4. {c |} {res} 4    3 {txt}{c |}
  5. {c |} {res} 5    3 {txt}{c |}
     {c LT}{hline 4}{c -}{hline 4}{c RT}
  6. {c |} {res} 6    4 {txt}{c |}
  7. {c |} {res} 7    2 {txt}{c |}
  8. {c |} {res} 8    3 {txt}{c |}
  9. {c |} {res} 9    1 {txt}{c |}
 10. {c |} {res}10    2 {txt}{c |}
     {c BLC}{hline 4}{c -}{hline 4}{c BRC}

{com}. //_12
. tabulate Q1

         {txt}Q1 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         21       21.00       21.00
{txt}          2 {c |}{res}         29       29.00       50.00
{txt}          3 {c |}{res}         28       28.00       78.00
{txt}          4 {c |}{res}         22       22.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        100      100.00
{txt}
{com}. //_13
. graph bar, over(Q1) scheme(michigan2) asyvars
{res}{txt}
{com}.     
. graph export mybar2.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
mybar2.png{rm}
saved as
PNG
format
{p_end}

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Desktop\GitHub\agrogan1.github.io\myposts\why-Excel-is-a-bad-format-for-storing-data.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}26 Jul 2022, 12:40:36
{txt}{.-}
{smcl}
{txt}{sf}{ul off}